<a href="https://colab.research.google.com/github/farcorn71/CEMS/blob/master/PandasTut.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
# create a dataframe from a dictionary
df_dict = {'Country': ['Ghana', 'Kenya', 'Nigeria', 'Togo'],
           'Capital': ['Accra', 'Nairobi', 'Abuja', 'Lome'],
           'Population': [10000, 8500, 35000, 12000],
           'Age': [60, 70, 80, 75]
}

In [ ]:
import pandas as pd
import numpy as np
brics = pd.DataFrame(df_dict,columns=['Country','Age','Population','Capital'],index=[2,4,6,8])
print(brics)

   Country  Age  Population  Capital
2    Ghana   60       10000    Accra
4    Kenya   70        8500  Nairobi
6  Nigeria   80       35000    Abuja
8     Togo   75       12000     Lome

In [ ]:
## See where there are null values
# check for cells with missing values as True
brics.isnull()

   Country    Age  Population  Capital
2    False  False       False    False
4    False  False       False    False
6    False  False       False    False
8    False  False       False    False

In [ ]:
# remove rows with missing values
brics.dropna()

   Country  Age  Population  Capital
2    Ghana   60       10000    Accra
4    Kenya   70        8500  Nairobi
6  Nigeria   80       35000    Abuja
8     Togo   75       12000     Lome

In [ ]:
print(brics['Population'].sum())

65500

In [ ]:
brics.mean()

Age              71.25
Population    16375.00
dtype: float64

In [ ]:
brics.describe()

             Age    Population
count   4.000000      4.000000
mean   71.250000  16375.000000
std     8.539126  12499.166639
min    60.000000   8500.000000
25%    67.500000   9625.000000
50%    72.500000  11000.000000
75%    76.250000  17750.000000
max    80.000000  35000.000000

In [ ]:
# select the row in the at index 3
brics.iloc[3]

Country        Togo
Age              75
Population    12000
Capital        Lome
Name: 8, dtype: object

In [ ]:
# select row with index label 6
brics.loc[6]

Country       Nigeria
Age                80
Population      35000
Capital         Abuja
Name: 6, dtype: object

In [ ]:
# select the Capital column
brics['Capital']

2      Accra
4    Nairobi
6      Abuja
8       Lome
Name: Capital, dtype: object

In [ ]:
brics.at[6, 'Country']
brics.iat[2, 1]

80

In [ ]:
df_list = [['Ghana', 'Accra', 10000, 60], 
           ['Kenya', 'Nairobi', 8500, 70], 
           ['Nigeria',   'Abuja', 35000, 80], 
           ['Togo', 'Lome', 12000, 75]]
df1 = pd.DataFrame(df_list, columns=['Country', 'Capital','Population', 'Age'], 
                   index=[2, 4, 6, 8])
print(df1)

   Country  Capital  Population  Age
2    Ghana    Accra       10000   60
4    Kenya  Nairobi        8500   70
6  Nigeria    Abuja       35000   80
8     Togo     Lome       12000   75

In [ ]:
days = pd.Series(['Monday', 'Tuesday', 'Wednesday'])
print(days) # prints

0       Monday
1      Tuesday
2    Wednesday
dtype: object

In [ ]:
days_list = np.array(['Monday', 'Tuesday', 'Wednesday'])
numpy_days = pd.Series(days_list)
print(numpy_days) # prints

0       Monday
1      Tuesday
2    Wednesday
dtype: object

In [ ]:
days = pd.Series(['Monday', 'Tuesday', 'Wednesday'], 
 index=['a', 'b', 'c'])
# create series from a dictionary
days1 = pd.Series({'a':'Monday', 'b':'Tuesday', 'c':'Wednesday'})
print(days1)

a       Monday
b      Tuesday
c    Wednesday
dtype: object

In [ ]:
print(days[0]) # =  Monday

print(days[1: ]) #= b      Tuesday
           # c    Wednesday
           # dtype: object

print(days['c'])

Monday
b      Tuesday
c    Wednesday
dtype: object
Wednesday